## Intermediate SQL

In [1]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    for row in cursor:
        display(row)
df = print_all()
display(df.head())

,0,1,2,3,4,5,6,7,8
0,389,Sheena,1984.0,UK,117.0,English,PG,NaN,25000000.0
1,390,Splash,1984.0,USA,111.0,English,PG,69800000.0,8000000.0
2,391,Star Trek III: The Search for Spock,1984.0,USA,105.0,English,PG,76400000.0,17000000.0
3,392,The Bounty,1984.0,UK,132.0,English,PG,8600000.0,25000000.0
4,393,The Cotton Club,1984.0,USA,123.0,English,R,25900000.0,58000000.0

### Selecting Data

#### Course road map
- Querying databases
- Count and view specified records
- Understand query execution and style
- Filtering
- Aggregate functions
- Sorting and grouping

#### Our films database
* films
- id                INT4
- title             VARCHAR
- release_year      INT4
- country           VARCHAR
- duration          INT4
- language          VARCHAR
- certification     VARCHAR
- gross             INT8
- budget            INT8

* people
- id                INT4
- name              VARCHAR
- birthdate         DATE
- deathdate         DATE

* reviews
- id                INT4
- film_id           INT4
- num_user          INT4
- num_critic        INT4
- imdb_score        FLOAT4
- num_votes         INT4
- facebook_likes    INT4

* roles
- id                INT4
- film_id           INT4
- person_id         INT4
- role              VARCHAR

#### COUNT()
- `COUNT()`
- Counts the number of records with a value in a field

In [12]:
sql = """SELECT COUNT(BIRTHDATE) AS count_birthdates
FROM PEOPLE"""
run_statement(sql)

(6152,)

#### COUNT() multiple fields

In [13]:
# SELECT COUNT(name) AS count_names, COUNT(birthdate) AS count_birthdates
# FROM people;
sql = """SELECT COUNT(NAME) AS count_names, COUNT(BIRTHDATE) AS count_birthdates FROM PEOPLE"""
run_statement(sql)

(8397, 6152)

#### Using * with COUNT()
- `COUNT(field_name)` counts values in a field
- `COUNT(*)` counts records in a table
- `*` represents all fields

In [14]:
# SELECT COUNT(*) AS total_records
# FROM people;
sql = """SELECT COUNT(*) AS total_records FROM PEOPLE"""
run_statement(sql)

(8397,)

#### DISTINCT
* `DISTINCT` removes duplicates to return only unique values

In [ ]:
# SELECT language FROM films;
sql = """SELECT DISTINCT LANGUAGE from  FILMS"""
run_statement(sql)

#### COUNT() with DISTINCT
* Combine `COUNT()` with DISTINCT to count unique values

In [3]:
sql = """SELECT COUNT(DISTINCT birthdate) AS count_distinct_birthdates FROM people"""
run_statement(sql)

(5398,)

* `COUNT()` includes duplicates
* `DISTINCT` excludes duplicates